import React from "react";

const Info = () => {
  return (
    <div className="flex flex-col">
      <div className="font-semibold text-orange-500 flex flex-col justify-center items-center">
        <h1 className="text-2xl">छत्रपती शिवाजी महाराजांचा जन्म</h1>
        <p>
          छत्रपती शिवाजी महाराज हे भारताचे महान योद्धे होते. ते मराठा
          साम्राज्याचे राजाही होते. महाराजांचा जन्म 19 फेब्रुवारी 1630 रोजी
          शिवनेरी किल्ल्यावर झाला. महाराजांचे वडील शहाजी भोसले हे विजापूर येथील
          सुलतानाच्या सैन्यात सेनापती होते आणि महाराजांच्या आई जिजाबाई या जाधव
          कुळात जन्मलेल्या प्रतिभावान स्त्री होत्या.
          <br />
          त्यांचे बालपण त्यांच्या आईच्या मार्गदर्शनाखाली गेले. त्यांची आई
          जिजाबाई यांनी महाराजांना राजकारण आणि युद्धाचे प्रशिक्षण दिले तसेच
          परकीय शक्तींवर हल्ला करण्यासाठी आवश्यक असलेल्या शिस्तीचे प्रशिक्षण
          दिले. त्यांनी महाराजांच्या शिक्षणाची जबाबदारी घेतली आणि त्यांना
          युद्धकलेचे शिक्षण दिले. एवढ्या लहान वयातही महाराजांना हा सारा प्रसंग
          समजू लागला होता.
        </p>
      </div>
      <div className="font-semibold text-orange-500 flex flex-col justify-center items-center">
        <h1 className="text-2xl">स्वराज्य निर्माण करण्याची इच्छा</h1>
        <p>
          महाराजांचा जन्म शिवनेरी येथे झाला. शिवनेरीसोबतच त्यांचे बालपण माहुली
          आणि पुण्यात गेले . शहाजी महाराजांनी संपूर्ण महाराष्ट्राचा कारभार
          छत्रपती शिवाजी महाराज आणि जिजाबाई यांच्याकडे सोपवून त्यांना पुण्याला
          पाठवले. जहांगिरी व्यवस्था दादाजी कोंडदेव आणि शहाजी राजांनी नियुक्त
          केलेल्या काही निष्ठावंत सरदारांची देखरेख करत असे.
          <br />
          आई जिजाबाईं प्रमाणेच छत्रपती शिवाजी महाराजांमध्येही कणखरपणा, देशप्रेम
          आणि कठीण परिस्थितीतून बाहेर पडण्याचे ध्येय होते. या गुणांमुळेच छत्रपती
          शिवाजी महाराज घडले. आईकडून मिळालेली शिकवण आणि प्रेरणा छत्रपती शिवाजी
          महाराजांना स्वराज्य निर्माण करण्यासाठी प्रेरित करते. स्वराज्य म्हणजे
          स्वतःचे राज्य. आपल्या स्वराज्याचे रक्षण करायचे असेल तर किल्ले हवेत असे
          महाराजांना वाटत असे. हे त्यांना लहान वयातच कळले. दादोजी कोंडदेव
          यांच्या मृत्यूनंतर आता संपूर्ण महाराष्ट्राची जबाबदारी छत्रपती शिवाजी
          महाराजांवर होती.त्यांनी हळूहळू किल्ले काबीज करण्यासाठी अनेक मोहिमा
          राबवल्या आणि त्या यशस्वीपणे पूर्ण केल्या. त्यांनी त्यांच्या वयातील शूर
          तरुणांना एकत्र केले आणि देशपांडे, देशमुख इत्यादींशीही त्यांचे वेगळे
          संबंध होते. महाराजांनी हळूहळू पुण्याच्या आजूबाजूचे काही उध्वस्त किल्ले
          आणि डोंगर काबीज करण्यास सुरुवात केली. तोरणा किल्ला हा महाराजांचा पहिला
          काबीज केलेला किल्ला होता. त्यानंतर त्यांनी राजगड आणि हळूहळू एकूण 360
          किल्ले ताब्यात घेतले. त्यांना तानाजी मालसुरे, नेताजी पालकर, कान्होजी
          जेधे, येसाजी कंक, बाजीप्रभू देशपांडे, बाजी पासलकर आदी दिग्गज
          व्यक्तींची साथ होती.
        </p>
      </div>
      <div className="font-semibold text-orange-500 flex flex-col justify-center items-center">
        <h1 className="text-2xl">स्वराज्य शपथ</h1>
        <p>
          रायरेश्वर किल्ला स्वराज्याच्या शपथेचा साक्षीदार आहे. याच गडावर छत्रपती
          शिवाजी महाराजांनी स्वराज्याची शपथ घेतली होती. ते फक्त 16 वर्षांचे
          असताना छत्रपती शिवाजी महाराजांनी रायरेश्वर किल्ल्यावर स्वराज्य तोरण
          बांधले. हिंदवी स्वराज्य स्थापन करू इच्छिणाऱ्या छत्रपती शिवाजी
          महाराजांनी शूर तरुणांचा एक गट तयार केला ज्याला त्यांनी "मावळा" असे नाव
          दिले.
          <br />
          या मूठभर मावळ्यांच्या मदतीने त्यांच्यात धर्मप्रेम निर्माण करून
          त्यांच्याशी लढा दिला, स्वराज्याची संकल्पना शिकवली आणि समजावून
          सांगितली. हिंदवी स्वराज्यासाठी मावळ्यांनी आपले रक्त सांडले. अवघ्या
          पन्नास वर्षांच्या कालावधीत त्यांनी विजापूर आणि दिल्लीच्या राजांना
          आपल्यापुढे झुकवले. महाराजांनी रायरेश्वर किल्ल्यावर हिंदवी स्वराज्य
          स्थापनेची घोषणा केली त्यांचा राज्याभिषेक केला. हिंदू धर्माला हक्काचा
          राजा मिळाला. राज्यातील जनता छत्रपती शिवाजी महाराजांना आपले भविष्य
          सांगू लागली
          <br />
          महाराजांनी हिंदू धर्मातील वेद, पुराणे आणि मंदिरे यांचे रक्षण केले आणि
          वयाच्या 16 व्या वर्षी महाराजांनी 27 एप्रिल रोजी कान्होजी जेधे, बाजी
          पासलकर, तानाजी मालसुरे, नरसप्रभु गुप्ते, सोनोपंत डबीर, सूर्याजी
          मालुसरे, येसाजी कंक, सूर्याजी काकडे सह रायरेश्वर मंदिरात जाऊन
          स्वराज्याची शपथ घेतली.
        </p>
      </div>
      <div className="font-semibold text-orange-500 flex flex-col justify-center items-center">
        <h1 className="text-2xl">छत्रपती शिवाजी महाराजांचा विवाह</h1>
        <p>
          छत्रपती शिवाजी महाराजांनी या सर्व जातींच्या लोकांना मावळ्यांच्या
          नावाने संघटित केले आणि त्यांच्याशी संपर्क करून त्यांची ओळख करून घेतली.
          त्यांनी युवकांना आणून किल्ल्याचे बांधकाम सुरू केले.पुढे मावळ्यांचे
          सहकार्य छत्रपती शिवाजी महाराजांसाठी अत्यंत महत्त्वाचे ठरले. त्या वेळी
          विजापूर घुसखोरी आणि मुघल आक्रमणांनी त्रस्त होते.विजापूरच्या सुलतान
          आदिलशहाने अनेक किल्ल्यांमधून आपले सैन्य काढून घेतले आणि ते स्थानिक
          राज्यकर्त्यांच्या किंवा सरंजामदारांच्या स्वाधीन केले.
          <br />
          आदिलशहाच्या आजारपणाची आता विजापूरमध्ये चर्चा होऊ लागली आणि छत्रपती
          शिवाजी महाराजांनी परिस्थितीचा फायदा घेत विजापूरमध्ये प्रवेश करण्याचे
          ठरवले. पुढे छत्रपती शिवाजी महाराजांनी विजापूरचे किल्ले काबीज करण्यास
          सुरुवात केली. छत्रपती शिवाजी महाराजांनी प्रथम तोरणा किल्ला ताब्यात
          घेतला आणि नंतर छत्रपती शिवाजी महाराजांनी रोहिडेश्वर किल्ला ताब्यात
          घेतला.
          <br />
          छत्रपती शिवाजी महाराजांनी आपल्या एका दूताला आदिलशहाकडे पाठवले आणि
          सांगितले की, मी तुला आधीच्या किल्ल्याचा रखवालदारापेक्षा जास्त पैसे
          द्यायला तयार आहे. त्यामुळे हा प्रदेश काबीज करण्यासाठी महाराजांनी
          आदिलशहाच्या काही सरदारांना आपल्या बाजूने सामील होण्यासाठी आधीच लाच
          दिली होती.
        </p>
      </div>
      <div className="font-semibold text-orange-500 flex flex-col justify-center items-center">
        <h1 className="text-2xl">राज्याचा विस्तार</h1>
        <p>
          छत्रपती शिवाजी महाराजांचा विवाह सईबाई निंबाळकर यांच्याशी 14 मे 1640
          रोजी लाल महाल पुणे येथे झाला. महाराजांनी एकूण आठ विवाह केले.
          व्यावहारिक राजकारण चालू ठेवण्यासाठी महाराजांनी एकूण आठ विवाह केले.
          मराठा सरदारांना एका छत्राखाली आणण्यात महाराजांना यश आले.
          <br />
          महाराजांचा पहिला विवाह सईबाई निंबाळकर यांच्याशी झाला. त्यांनी नंतर
          सोयराबाई मोहिते, पुतलाबाई पालकर, सकवारबाई गायकवाड, काशीबाई जाधव आणि
          सगुणाबाई शिंदे यांच्याशी विवाह केला. त्यांचा विवाहही गुणवंतीबाई इंगळे
          आणि लक्ष्मीबाई विचारे यांच्याशी झाला होता. सईबाईंनी एक मुलगा संभाजी
          (1657 ते 1689) आणि सोयराबाई यांना राजाराम (1670 ते 1700) यांना जन्म
          दिला. याशिवाय महाराजांना काही मुलीही होत्या
        </p>
      </div>
      <div className="font-semibold text-orange-500 flex flex-col justify-center items-center">
        <h1 className="text-2xl">अफझलखानाचा वध</h1>
        <p>
          महाराजांच्या शौर्यामुळे किल्ला काबीज करण्याच्या त्यांच्या हालचालींना
          वेग आला. त्यामुळे मुघल, निजाम आणि आदिलशाही यांच्यात अराजक माजले होते.
          म्हणूनच आदिलशहाने इ.स. 1659 मध्ये आपल्या दरबारात छत्रपती शिवाजी
          महाराजांची हत्या करण्याचा निर्णय घेतला. आदिलशहाला आपल्या सैनिकांवर खूप
          राग आला आणि म्हणूनच त्याने आपल्या सैनिकांना आव्हान दिले की तुमच्यापैकी
          कोणी एक छत्रपती शिवाजी महाराजांना मारेल. तेवढ्यात अफझलखान नावाचा शिपाई
          पुढे आला आणि त्याने महाराजांना ठार मारण्याची प्रतिज्ञा घेतली. .
          अफझलखान महाराजांचा पराभव करण्यासाठी मोठ्या सैन्यासह निघाला. वाटेत तो
          हिंदू धर्मातील सर्व मंदिरे उध्वस्त करू लागला आणि गरिबांनाही त्रास देऊ
          लागला. वाईला पोहोचल्यावर महाराजांनी त्यांना प्रतापगडावर भेटायचे ठरवले.
          अफजलखान प्रतापगडच्या पायथ्याशी बसला होता.
          <br />
          अफजल खानाने छत्रपती शिवाजी महाराजांना भेटण्याचा निरोप पाठविला. छत्रपती
          शिवाजी महाराजांना त्याच्याघातपाती स्वभावाची जाणीव होती.भेटीसाठी
          कोणतेही हत्यार कोणाकडे नसतील आणि दोन्ही पक्षाचे 10 अंगरक्षक असतील त्या
          अंगरक्षकांपैकी एक शामियानाच्या बाहेर थांबेल.अशी अट ठरली.
          <br />
          भेटीच्या वेळी अफजलखान वेळेआधीच शामियानेत पोहोचला.शामियाना मोठा होता.
          निःशस्त्र भेटायचे असे ठरले होते. तरी ही अफजलखानाने आपल्या अंगरख्याखाली
          कट्यार लपवून ठेवली होती. अफजल खान काही कट कारस्थान करून घात पात करेल
          ह्याचा अंदाज छत्रपती शिवाजी महाराजांना आला होता. म्हणून त्यांनी देखील
          आपल्या अंगरख्याखाली चिलखत घातले ,जिरेटोप खाली शिरस्त्राण घातले आणि
          मुठीत सहज न दिसणारी अशी वाघनखे लपविली होती.दोघांचे वकीलच बरोबर असतील
          असे ठरले. अफजल खानाची उंचीपुरी देहयष्टी होती तरी ही छत्रपती शिवाजी
          राजे न घाबरता शामियानात पोहोचले. शिवरायांना बघून या शिवबा आमच्या मिठीत
          या असं म्हणत अफजल खानाने मिठी मारण्यासाठी हात पसरविले आणि त्यांना जवळ
          बोलविले. छत्रपती शिवाजी महाराजांनी त्याला मिठी मारली. अफजल खान ने
          त्यांना आपल्या बाहुपाशेत घेण्याचा प्रयत्न केला आणि अफजल खानाने
          लपविल्या कट्यारने छत्रपती शिवाजी महाराजांच्या पाठीत वार केला आणि
          त्यांना आपल्या काखेत दाबण्याचा प्रयत्न केला. छत्रपती शिवाजी महाराज
          पूर्वी पासून सावध होते. अफजल खानाच्या प्रहाराने छत्रपती शिवाजी
          महाराजांनी आपल्या मुठीतील वाघनखे काढून त्याच्या पोटात घुसवून त्याच्या
          आतड्याचं बाहेर काढल्या आणि त्याला ठार केले.
        </p>
      </div>
      <div className="font-semibold text-orange-500 flex flex-col justify-center items-center">
        <h1 className="text-2xl">छत्रपती शिवाजी महाराजांवर लिहिलेली पुस्तके</h1>
        <p>
          त्यांच्या जीवन शैलीवर आधारित अनेक पुस्तके आणि चित्रपट छत्रपती शिवाजी
          महाराजांवर वेगवेगळ्या शैलीत सादर केले गेले आहेत. छत्रपती शिवाजी
          महाराजांवर आतापर्यंत 60 हून अधिक पुस्तके लिहिली गेली असून ही पुस्तके
          केवळ मराठीतच नाही तर इतर भाषांमध्येही उपलब्ध आहेत. काही उत्तम साहित्य
          म्हणजे: आग्राहून सुटका , आज्ञापत्र, शिवछत्रपतींचे चरित्र, राजा शिवाजी,
          शिवराय, गड आला पण सिंह गेला, उष: काल, श्रीमानयोगी, कुलवाडीभूषण शिवराय,
          छत्रपती शिवरायांचे कष्टकरी मावळे, थोरलं राजन सांगून गेलं, शिवछत्रपती,
          शिवनामा, शिवभूषण, छत्रपती शिवाजी आणि सुराज्य, राजा शिवछत्रपती.
        </p>
      </div>
      <div className="font-semibold text-orange-500 flex flex-col justify-center items-center">
        <h1 className="text-2xl">छत्रपती शिवाजी महाराजांचा मृत्यू</h1>
        <p>
          मार्च 1680 च्या उत्तरार्धात, हनुमान जयंतीच्या पूर्वसंध्येला, छत्रपती
          शिवाजी ताप आणि आमांशाने आजारी पडले आणि 3 एप्रिल 1680 रोजी त्यांचे निधन
          झाले.
        </p>
      </div>
    </div>
  );
};

export default Info;
